tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "libpng"
brew "m4"
brew "autoconf"
brew "automake"
brew "gmp"
brew "openssl@3"
brew "asdf"
brew "bison"
brew "freetype"
brew "fzf"
brew "gcc"
brew "gd"
brew "gettext"
brew "gpg"
brew "icu4c"
brew "imagemagick"
brew "jpeg"
brew "krb5"
brew "lazygit"
brew "libedit"
brew "libiconv"
brew "libsodium"
brew "libxml2"
brew "libzip"
brew "neovim"
brew "oniguruma"
brew "openssl@1.1"
brew "pkg-config"
brew "re2c"
brew "ripgrep"
brew "tmux"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "discord"
cask "docker"
cask "font-monaspace"
cask "google-chrome"
cask "google-japanese-ime"
cask "phpstorm"
cask "raycast"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "wezterm"
