brew "giflib"
brew "libpng"
brew "openssl@3"
brew "arp-scan"
brew "m4"
brew "autoconf"
brew "automake"
brew "bison"
brew "freetype"
brew "gettext"
brew "glib"
brew "pixman"
brew "cairo"
brew "gmp"
brew "gcc"
brew "gd"
brew "libsodium"
brew "libzip"
brew "oniguruma"
brew "readline"
brew "php"
brew "composer"
brew "deck"
brew "fortune"
brew "fzf"
brew "gh"
brew "pango"
brew "gnupg"
brew "python@3.12"
brew "libheif"
brew "imagemagick"
brew "jpeg"
brew "lazygit"
brew "libarchive"
brew "libedit"
brew "libiconv"
brew "librsvg"
brew "libxml2"
brew "libyaml"
brew "mise"
brew "neovim"
brew "openssl@1.1"
brew "pkgconf"
brew "re2c"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "uv"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "canva"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-monaspace"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-japanese-ime"
cask "intellij-idea-ce"
cask "jetbrains-toolbox"
cask "notion"
cask "obsidian"
cask "phpstorm"
cask "raycast"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "webex"
cask "wezterm"
go "cmd/go"
go "cmd/gofmt"
