brew "giflib"
brew "libpng"
brew "openssl@3"
brew "arp-scan"
brew "m4"
brew "autoconf"
brew "automake"
brew "bison"
brew "freetype"
brew "gettext"
brew "glib"
brew "pixman"
brew "cairo"
brew "gmp"
brew "gcc"
brew "gd"
brew "libsodium"
brew "libzip"
brew "oniguruma"
brew "readline"
brew "php"
brew "composer"
brew "deck"
brew "fortune"
brew "fzf"
brew "gh"
brew "pango"
brew "gnupg"
brew "python@3.12"
brew "libheif"
brew "imagemagick"
brew "jpeg"
brew "lazygit"
brew "libarchive"
brew "libedit"
brew "libiconv"
brew "librsvg"
brew "libxml2"
brew "libyaml"
brew "mise"
brew "neovim"
brew "openssl@1.1"
brew "pkgconf"
brew "re2c"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "uv"
brew "zlib"
cask "1password"
cask "1password-cli"
cask "canva"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-monaspace"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-japanese-ime"
cask "intellij-idea-ce"
cask "jetbrains-toolbox"
cask "notion"
cask "obsidian"
cask "phpstorm"
cask "raycast"
cask "slack"
cask "tableplus"
cask "visual-studio-code"
cask "webex"
cask "wezterm"
vscode "aki77.rails-db-schema"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "atsushieno.language-review"
vscode "bierner.markdown-preview-github-styles"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.path-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "codingyu.laravel-goto-view"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glitchbl.laravel-create-view"
vscode "golang.go"
vscode "ihunte.laravel-blade-wrapper"
vscode "jaguadoromero.vscode-php-create-class"
vscode "jasonn-porch.gitlab-mr"
vscode "jduponchelle.rainbow-end"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "junstyle.php-cs-fixer"
vscode "mariusalchimavicius.json-to-ts"
vscode "mechatroner.rainbow-csv"
vscode "mehedidracula.php-constructor"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "naoray.laravel-goto-components"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "oracle.oracle-java"
vscode "patbenatar.advanced-new-file"
vscode "pgl.laravel-jump-controller"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "ryannaddy.laravel-artisan"
vscode "saoudrizwan.claude-dev"
vscode "shopify.ruby-lsp"
vscode "shufo.vscode-blade-formatter"
vscode "sianglim.slim"
vscode "sleistner.vscode-fileutils"
vscode "stylelint.vscode-stylelint"
vscode "sysoev.language-stylus"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "cmd/go"
go "cmd/gofmt"
